Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначенныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыДоговоровИСчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыПользователей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.НазначенныеРоли.Очистить();
	
	Для каждого СтрокаДоступныеРоли Из ЭтаФорма.ДоступныеРоли Цикл
		Если СтрокаДоступныеРоли.Пометка Тогда
			ЗаполнитьЗначенияСвойств(Объект.НазначенныеРоли.Добавить(), СтрокаДоступныеРоли, "Роль");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// События элементов формы

&НаКлиенте
Процедура ДоступныеРолиПометкаПриИзменении(Элемент)
	
	ЗаполнитьЗаголовокСтраницыРоли(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции формы

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Объект.Ссылка = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Организация.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Для каждого РольМД Из Метаданные.Роли Цикл
		НоваяСтрокаДоступныеРоли = ЭтаФорма.ДоступныеРоли.Добавить();
		НоваяСтрокаДоступныеРоли.Пометка       = (Объект.НазначенныеРоли.НайтиСтроки(Новый Структура("Роль", РольМД.Имя)).Количество() > 0);
		НоваяСтрокаДоступныеРоли.Роль          = РольМД.Имя;
		НоваяСтрокаДоступныеРоли.Представление = РольМД.Представление();
		НоваяСтрокаДоступныеРоли.Описание      = "";
	КонецЦикла;
	
	ЭтаФорма.ДоступныеРоли.Сортировать("Представление");
	
	ЗаполнитьЗаголовокСтраницыРоли(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовокСтраницыРоли(Форма)
	
	Помечено = 0;
	
	Для каждого СтрокаДоступныеРоли Из Форма.ДоступныеРоли Цикл
		Если СтрокаДоступныеРоли.Пометка Тогда
			Помечено = Помечено + 1;
		КонецЕсли;
	КонецЦикла;
	
	Форма.Элементы.СтраницаНазначенныеРоли.Заголовок = "Роль (" + Помечено + "/" + Форма.ДоступныеРоли.Количество() + ")";
	
КонецПроцедуры // ЗаполнитьЗаголовокСтраницыРоли

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Состав.Количество() > 0
		И ЗначениеЗаполнено(Объект.Организация)
		И Объект.Организация <> ВыбранноеЗначение Тогда
		
		Если Вопрос("При изменении организации будет очищен состав пользователей. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
		Иначе
			Объект.Состав.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
